### Worth saying this was only used on a Mac so your mileage may vary on other homebrew supported OS
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Distributed revision control system
brew "git"
# Modular IRC client
brew "irssi"
# Drop-in replacement for MySQL
brew "mariadb"
# Open source relational database management system
brew "mysql-client"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Programmatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Utility to set up alt-tab to switch between windows
cask "alt-tab"
# Virtual Audio Driver
cask "blackhole-2ch"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# System cleaner for logs, caches and more
cask "clean-me"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Messaging browser which combines several services
cask "ferdi"
# Web browser
cask "firefox"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Password manager app
cask "keepassxc"
# Visual diff and merge tool
cask "meld"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Open-source software for live streaming and screen recording
cask "obs"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Open source clipboard manager
cask "yippy"
